function getRandomElement(array: string[]):string {
    if (array.length == 0) { return "" }
    return array[Math.floor(Math.random() *  array.length)];
}
export const getMission = ():string => {
    return getRandomElement(randRoomNames);
}
const randRoomNames:string[] = [
    "オペレーション〈梟ストリクス〉",
    "妻役を確保せよ",
    "受験対策をせよ",
    "名門校面接試験",
    "合否の行方",
    "ナカヨシ作戦",
    "標的の次男",
    "対秘密警察偽装作戦",
    "ラブラブを見せつけよ",
    "ドッジボール大作戦",
    "星（ステラ）",
    "ペンギンパーク",
    "プロジェクト〈アップル〉",
    "時限爆弾を解除せよ",
    "新しい家族",
    "ヨル's キッチン／情報屋の恋愛大作戦",
    "ぐりほんさくせんを決行せよ／〈鋼鉄の淑女〉／オムライス♡",
    "家庭教師の叔父／〈東雲〉",
    "デズモンドへの復讐計画／母、風になる",
    "総合病院を調査せよ／難解な暗号を解読せよ",
    "〈夜帷〉／はじめての嫉妬",
    "地下テニス大会 キャンベルドン",
    "揺るがぬ軌道",
    "母役と妻役／ともだちとかいもの",
    "接敵作戦（ファーストコンタクト）",
    "ちちとははをびこうせよ",
    "ボンドの生存戦略／ダミアンの野外学習",
    "任務と家族／華麗なるボンドマン／子ども心／目覚まし",
    "知恵の甘味／情報屋の恋愛大作戦Ⅱ",
    "越境作戦",
    "戦慄の豪華客船",
    "誰がための任務",
    "船上の交響曲（シンフォニー）／姉のハーブティー",
    "未来を繋ぐ手",
    "リゾートを満喫せよ／休暇自慢",
    "バーリント・ラブ／〈夜帷〉の日常",
    "家族の一員",
]